run/tutorials/incompressible/pisoFoam/RAS/cavity/system/FOs/FOfieldStatistics
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

fieldStatistics1
{
    // Mandatory entries
    type            fieldStatistics;
    libs            (fieldFunctionObjects);
    fields          ( U p );
    statistics
    (
        min
        max
        mean
        variance
    );

    // Optional entries
    mode            component;
    mean            arithmetic;
    internal        false;
    extrema         true;

    // Optional (inherited) entries
    writePrecision  10;
    writeToFile     true;
    useUserTime     true;

    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   -1;
}


// ************************************************************************* //
